app/controllers/sign_ups_controller.rb

INSERT INTO `sign_ups` (`created_at`, `email`, `first_name`, `last_name`, `password`, `updated_at`) VALUES ('2015-04-29 06:22:11', '', '', '', '', '2015-04-29 06:22:11')
---
  def create

    @user = SignUp.new(sign_ups_params)

    if @user.save!